###################################################################

# Created by write_sdc on Tue Jun 27 02:46:41 2017

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max slow -max_library slow\
                         -min fast -min_library fast
set_wire_load_model -name tsmc090_wl10 -library slow
set_max_transition 1 [current_design]
set_max_fanout 8 [current_design]
set_max_area 0
set_load -pin_load 1 [get_ports out_valid]
set_load -pin_load 1 [get_ports {in_addr[15]}]
set_load -pin_load 1 [get_ports {in_addr[14]}]
set_load -pin_load 1 [get_ports {in_addr[13]}]
set_load -pin_load 1 [get_ports {in_addr[12]}]
set_load -pin_load 1 [get_ports {in_addr[11]}]
set_load -pin_load 1 [get_ports {in_addr[10]}]
set_load -pin_load 1 [get_ports {in_addr[9]}]
set_load -pin_load 1 [get_ports {in_addr[8]}]
set_load -pin_load 1 [get_ports {in_addr[7]}]
set_load -pin_load 1 [get_ports {in_addr[6]}]
set_load -pin_load 1 [get_ports {in_addr[5]}]
set_load -pin_load 1 [get_ports {in_addr[4]}]
set_load -pin_load 1 [get_ports {in_addr[3]}]
set_load -pin_load 1 [get_ports {in_addr[2]}]
set_load -pin_load 1 [get_ports {in_addr[1]}]
set_load -pin_load 1 [get_ports {in_addr[0]}]
set_load -pin_load 1 [get_ports {out_addr[15]}]
set_load -pin_load 1 [get_ports {out_addr[14]}]
set_load -pin_load 1 [get_ports {out_addr[13]}]
set_load -pin_load 1 [get_ports {out_addr[12]}]
set_load -pin_load 1 [get_ports {out_addr[11]}]
set_load -pin_load 1 [get_ports {out_addr[10]}]
set_load -pin_load 1 [get_ports {out_addr[9]}]
set_load -pin_load 1 [get_ports {out_addr[8]}]
set_load -pin_load 1 [get_ports {out_addr[7]}]
set_load -pin_load 1 [get_ports {out_addr[6]}]
set_load -pin_load 1 [get_ports {out_addr[5]}]
set_load -pin_load 1 [get_ports {out_addr[4]}]
set_load -pin_load 1 [get_ports {out_addr[3]}]
set_load -pin_load 1 [get_ports {out_addr[2]}]
set_load -pin_load 1 [get_ports {out_addr[1]}]
set_load -pin_load 1 [get_ports {out_addr[0]}]
set_load -pin_load 1 [get_ports {out_data[7]}]
set_load -pin_load 1 [get_ports {out_data[6]}]
set_load -pin_load 1 [get_ports {out_data[5]}]
set_load -pin_load 1 [get_ports {out_data[4]}]
set_load -pin_load 1 [get_ports {out_data[3]}]
set_load -pin_load 1 [get_ports {out_data[2]}]
set_load -pin_load 1 [get_ports {out_data[1]}]
set_load -pin_load 1 [get_ports {out_data[0]}]
set_load -pin_load 1 [get_ports finish]
set_max_fanout 20 [get_ports clk]
set_max_fanout 20 [get_ports rst]
set_max_fanout 20 [get_ports in_valid]
set_max_fanout 20 [get_ports {in_data[7]}]
set_max_fanout 20 [get_ports {in_data[6]}]
set_max_fanout 20 [get_ports {in_data[5]}]
set_max_fanout 20 [get_ports {in_data[4]}]
set_max_fanout 20 [get_ports {in_data[3]}]
set_max_fanout 20 [get_ports {in_data[2]}]
set_max_fanout 20 [get_ports {in_data[1]}]
set_max_fanout 20 [get_ports {in_data[0]}]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_latency 1  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -max -rise 0.5 [get_clocks clk]
set_clock_transition -max -fall 0.5 [get_clocks clk]
set_clock_transition -min -rise 0.5 [get_clocks clk]
set_clock_transition -min -fall 0.5 [get_clocks clk]
set_input_delay -clock clk  -max 1  [get_ports clk]
set_input_delay -clock clk  -min 0.1  [get_ports clk]
set_input_delay -clock clk  -max 1  [get_ports rst]
set_input_delay -clock clk  -min 0.1  [get_ports rst]
set_input_delay -clock clk  -max 1  [get_ports in_valid]
set_input_delay -clock clk  -min 0.1  [get_ports in_valid]
set_input_delay -clock clk  -max 1  [get_ports {in_data[7]}]
set_input_delay -clock clk  -min 0.1  [get_ports {in_data[7]}]
set_input_delay -clock clk  -max 1  [get_ports {in_data[6]}]
set_input_delay -clock clk  -min 0.1  [get_ports {in_data[6]}]
set_input_delay -clock clk  -max 1  [get_ports {in_data[5]}]
set_input_delay -clock clk  -min 0.1  [get_ports {in_data[5]}]
set_input_delay -clock clk  -max 1  [get_ports {in_data[4]}]
set_input_delay -clock clk  -min 0.1  [get_ports {in_data[4]}]
set_input_delay -clock clk  -max 1  [get_ports {in_data[3]}]
set_input_delay -clock clk  -min 0.1  [get_ports {in_data[3]}]
set_input_delay -clock clk  -max 1  [get_ports {in_data[2]}]
set_input_delay -clock clk  -min 0.1  [get_ports {in_data[2]}]
set_input_delay -clock clk  -max 1  [get_ports {in_data[1]}]
set_input_delay -clock clk  -min 0.1  [get_ports {in_data[1]}]
set_input_delay -clock clk  -max 1  [get_ports {in_data[0]}]
set_input_delay -clock clk  -min 0.1  [get_ports {in_data[0]}]
set_output_delay -clock clk  -max 1  [get_ports out_valid]
set_output_delay -clock clk  -min 0.1  [get_ports out_valid]
set_output_delay -clock clk  -max 1  [get_ports {in_addr[15]}]
set_output_delay -clock clk  -min 0.1  [get_ports {in_addr[15]}]
set_output_delay -clock clk  -max 1  [get_ports {in_addr[14]}]
set_output_delay -clock clk  -min 0.1  [get_ports {in_addr[14]}]
set_output_delay -clock clk  -max 1  [get_ports {in_addr[13]}]
set_output_delay -clock clk  -min 0.1  [get_ports {in_addr[13]}]
set_output_delay -clock clk  -max 1  [get_ports {in_addr[12]}]
set_output_delay -clock clk  -min 0.1  [get_ports {in_addr[12]}]
set_output_delay -clock clk  -max 1  [get_ports {in_addr[11]}]
set_output_delay -clock clk  -min 0.1  [get_ports {in_addr[11]}]
set_output_delay -clock clk  -max 1  [get_ports {in_addr[10]}]
set_output_delay -clock clk  -min 0.1  [get_ports {in_addr[10]}]
set_output_delay -clock clk  -max 1  [get_ports {in_addr[9]}]
set_output_delay -clock clk  -min 0.1  [get_ports {in_addr[9]}]
set_output_delay -clock clk  -max 1  [get_ports {in_addr[8]}]
set_output_delay -clock clk  -min 0.1  [get_ports {in_addr[8]}]
set_output_delay -clock clk  -max 1  [get_ports {in_addr[7]}]
set_output_delay -clock clk  -min 0.1  [get_ports {in_addr[7]}]
set_output_delay -clock clk  -max 1  [get_ports {in_addr[6]}]
set_output_delay -clock clk  -min 0.1  [get_ports {in_addr[6]}]
set_output_delay -clock clk  -max 1  [get_ports {in_addr[5]}]
set_output_delay -clock clk  -min 0.1  [get_ports {in_addr[5]}]
set_output_delay -clock clk  -max 1  [get_ports {in_addr[4]}]
set_output_delay -clock clk  -min 0.1  [get_ports {in_addr[4]}]
set_output_delay -clock clk  -max 1  [get_ports {in_addr[3]}]
set_output_delay -clock clk  -min 0.1  [get_ports {in_addr[3]}]
set_output_delay -clock clk  -max 1  [get_ports {in_addr[2]}]
set_output_delay -clock clk  -min 0.1  [get_ports {in_addr[2]}]
set_output_delay -clock clk  -max 1  [get_ports {in_addr[1]}]
set_output_delay -clock clk  -min 0.1  [get_ports {in_addr[1]}]
set_output_delay -clock clk  -max 1  [get_ports {in_addr[0]}]
set_output_delay -clock clk  -min 0.1  [get_ports {in_addr[0]}]
set_output_delay -clock clk  -max 1  [get_ports {out_addr[15]}]
set_output_delay -clock clk  -min 0.1  [get_ports {out_addr[15]}]
set_output_delay -clock clk  -max 1  [get_ports {out_addr[14]}]
set_output_delay -clock clk  -min 0.1  [get_ports {out_addr[14]}]
set_output_delay -clock clk  -max 1  [get_ports {out_addr[13]}]
set_output_delay -clock clk  -min 0.1  [get_ports {out_addr[13]}]
set_output_delay -clock clk  -max 1  [get_ports {out_addr[12]}]
set_output_delay -clock clk  -min 0.1  [get_ports {out_addr[12]}]
set_output_delay -clock clk  -max 1  [get_ports {out_addr[11]}]
set_output_delay -clock clk  -min 0.1  [get_ports {out_addr[11]}]
set_output_delay -clock clk  -max 1  [get_ports {out_addr[10]}]
set_output_delay -clock clk  -min 0.1  [get_ports {out_addr[10]}]
set_output_delay -clock clk  -max 1  [get_ports {out_addr[9]}]
set_output_delay -clock clk  -min 0.1  [get_ports {out_addr[9]}]
set_output_delay -clock clk  -max 1  [get_ports {out_addr[8]}]
set_output_delay -clock clk  -min 0.1  [get_ports {out_addr[8]}]
set_output_delay -clock clk  -max 1  [get_ports {out_addr[7]}]
set_output_delay -clock clk  -min 0.1  [get_ports {out_addr[7]}]
set_output_delay -clock clk  -max 1  [get_ports {out_addr[6]}]
set_output_delay -clock clk  -min 0.1  [get_ports {out_addr[6]}]
set_output_delay -clock clk  -max 1  [get_ports {out_addr[5]}]
set_output_delay -clock clk  -min 0.1  [get_ports {out_addr[5]}]
set_output_delay -clock clk  -max 1  [get_ports {out_addr[4]}]
set_output_delay -clock clk  -min 0.1  [get_ports {out_addr[4]}]
set_output_delay -clock clk  -max 1  [get_ports {out_addr[3]}]
set_output_delay -clock clk  -min 0.1  [get_ports {out_addr[3]}]
set_output_delay -clock clk  -max 1  [get_ports {out_addr[2]}]
set_output_delay -clock clk  -min 0.1  [get_ports {out_addr[2]}]
set_output_delay -clock clk  -max 1  [get_ports {out_addr[1]}]
set_output_delay -clock clk  -min 0.1  [get_ports {out_addr[1]}]
set_output_delay -clock clk  -max 1  [get_ports {out_addr[0]}]
set_output_delay -clock clk  -min 0.1  [get_ports {out_addr[0]}]
set_output_delay -clock clk  -max 1  [get_ports {out_data[7]}]
set_output_delay -clock clk  -min 0.1  [get_ports {out_data[7]}]
set_output_delay -clock clk  -max 1  [get_ports {out_data[6]}]
set_output_delay -clock clk  -min 0.1  [get_ports {out_data[6]}]
set_output_delay -clock clk  -max 1  [get_ports {out_data[5]}]
set_output_delay -clock clk  -min 0.1  [get_ports {out_data[5]}]
set_output_delay -clock clk  -max 1  [get_ports {out_data[4]}]
set_output_delay -clock clk  -min 0.1  [get_ports {out_data[4]}]
set_output_delay -clock clk  -max 1  [get_ports {out_data[3]}]
set_output_delay -clock clk  -min 0.1  [get_ports {out_data[3]}]
set_output_delay -clock clk  -max 1  [get_ports {out_data[2]}]
set_output_delay -clock clk  -min 0.1  [get_ports {out_data[2]}]
set_output_delay -clock clk  -max 1  [get_ports {out_data[1]}]
set_output_delay -clock clk  -min 0.1  [get_ports {out_data[1]}]
set_output_delay -clock clk  -max 1  [get_ports {out_data[0]}]
set_output_delay -clock clk  -min 0.1  [get_ports {out_data[0]}]
set_output_delay -clock clk  -max 1  [get_ports finish]
set_output_delay -clock clk  -min 0.1  [get_ports finish]
set_input_transition -max 0.5  [get_ports clk]
set_input_transition -min 0.5  [get_ports clk]
set_input_transition -max 0.5  [get_ports rst]
set_input_transition -min 0.5  [get_ports rst]
set_input_transition -max 0.5  [get_ports in_valid]
set_input_transition -min 0.5  [get_ports in_valid]
set_input_transition -max 0.5  [get_ports {in_data[7]}]
set_input_transition -min 0.5  [get_ports {in_data[7]}]
set_input_transition -max 0.5  [get_ports {in_data[6]}]
set_input_transition -min 0.5  [get_ports {in_data[6]}]
set_input_transition -max 0.5  [get_ports {in_data[5]}]
set_input_transition -min 0.5  [get_ports {in_data[5]}]
set_input_transition -max 0.5  [get_ports {in_data[4]}]
set_input_transition -min 0.5  [get_ports {in_data[4]}]
set_input_transition -max 0.5  [get_ports {in_data[3]}]
set_input_transition -min 0.5  [get_ports {in_data[3]}]
set_input_transition -max 0.5  [get_ports {in_data[2]}]
set_input_transition -min 0.5  [get_ports {in_data[2]}]
set_input_transition -max 0.5  [get_ports {in_data[1]}]
set_input_transition -min 0.5  [get_ports {in_data[1]}]
set_input_transition -max 0.5  [get_ports {in_data[0]}]
set_input_transition -min 0.5  [get_ports {in_data[0]}]
